// ==========================================================================================
// Маршрути для категорій
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт контролерів

// Імпорт middleware перевірки аутентифікації
import { authenticate } from '../middleware/authenticate.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// GET /categories - Отримання списку категорій рецептів
// -------------------------------------------------------------------------------------------

// ===========================================================================================

// Експорт роутера
export default router;
