// ==========================================================================================
// Маршрути для категорій
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';
import { getCategories } from '../controllers/categoriesController.js';
// Імпорт контролерів

// Імпорт middleware перевірки аутентифікації
// import { authenticate } from '../middleware/authenticate.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// GET /categories - Отримання списку категорій рецептів
// -------------------------------------------------------------------------------------------
router.get('/categories', getCategories);
// ===========================================================================================

// Експорт роутера
export default router;
