// ==========================================================================================
// Маршрути для інгредієнтів
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт контролерів
import { getIngredients } from '../controllers/ingredientsController.js';

// Створення роутеру
const router = Router();

// GET /ingredients - Отримання списку інгредієнтів
// ==========================================================================================
router.get('/ingredients', getIngredients);

// Експорт роутера
export default router;
