// ==========================================================================================
// Маршрути для рецептів
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт контролерів

// Імпорт middleware перевірки аутентифікації
import { authenticate } from '../middleware/authenticate.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// GET /recipes - Пошук рецептів за категорією, інгредієнтом, входженням пошукового значення в назву рецепту (з урахуванням логіки пагінації)
// -------------------------------------------------------------------------------------------

// ===========================================================================================

// Експорт роутера
export default router;
