// ==========================================================================================
// Маршрути для користувача
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт контролерів
import { getCurrentUser } from '../controllers/usersController.js';

// Імпорт middleware перевірки аутентифікації
import { authenticate } from '../middleware/authenticate.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// GET /users/me - Отримання інформації про користувача
// -------------------------------------------------------------------------------------------
router.get('/users/me', authenticate, getCurrentUser);

// ===========================================================================================

// Експорт роутера
export default router;
