// ===========================================================================================
// Контролери для роботи з категоріями
// -------------------------------------------------------------------------------------------
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
import createHttpError from 'http-errors';

// Імпорт моделі Category
import { Category } from '../models/category.js';

// ===========================================================================================
// GET /categories - Отримання списку категорій рецептів
// ===========================================================================================
export const getCategories = async (req, res, next) => {
  try {
    // Пошук в колекції Category - сортування за іменем
    const categories = await Category.find().sort({ name: 1 });

    // Якщо категорій немає
    if (!categories) {
      throw createHttpError(404, 'Categories not found');
    }

    // Повертаємо дані зі списком категорій
    res.status(200).json({ categories });
  } catch (error) {
    next(error);
  }
};
