// ===========================================================================================
// Контролери для роботи з категоріями
// -------------------------------------------------------------------------------------------
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
import createHttpError from 'http-errors';

// ===========================================================================================
// GET /categories - Отримання списку категорій рецептів
// -------------------------------------------------------------------------------------------
