// ===========================================================================================
// Контролери для роботи з категоріями
// -------------------------------------------------------------------------------------------
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
// import createHttpError from 'http-errors';
import { Category } from '../models/category.js';
// ===========================================================================================
// GET /categories - Отримання списку категорій рецептів
// -------------------------------------------------------------------------------------------
export const getCategories = async (req, res, next) => {
  try {
    const categories = await Category.find().sort({ name: 1 });

    res.status(200).json({
      status: 200,
      message: 'List of categories',
      data: categories,
    });
  } catch (error) {
    next(error);
  }
};
