// ===========================================================================================
// Контролери для роботи з інгредієнтами
// -------------------------------------------------------------------------------------------
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
import createHttpError from 'http-errors';

// ===========================================================================================
// GET /ingredients - Отримання списку інгредієнтів
// -------------------------------------------------------------------------------------------
