// ===========================================================================================
// Контролери для роботи з рецептами
// -------------------------------------------------------------------------------------------
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
import createHttpError from 'http-errors';

// Імпорт функції запису файла в Cloudinary
import { saveFileToCloudinary } from '../utils/saveFileToCloudinary.js';
