// ===========================================================================================
// Контролер recipesMyController - для отримання власних рецептів
// -------------------------------------------------------------------------------------------

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
// import createHttpError from 'http-errors';

// Імпорт моделей

// GET /recipes/my
export const getMyRecipes = async (req, res, next) => {
  try {
    // Тіло контролера
    const recipes = [{}];

    // У разі вдалої обробки запиту відповідь сервера має бути зі статусом 200
    res.status(200).json({
      message: 'List of my recipes',
      data: recipes,
    });
  } catch (error) {
    next(error);
  }
};
