// ===========================================================================================
// Контролер —  отримання інформації про поточного користувача
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
// import createHttpError from 'http-errors';

// Імпорт моделі користувача User
// import { User } from '../models/user.js';

// ===========================================================================================
// GET /users/me
// -------------------------------------------------------------------------------------------
export const getCurrentUser = async (req, res, next) => {
  try {
    // Поточний користувач - з запиту
    const user = req.user;

    // У разі вдалої обробки запиту відповідь сервера має бути зі статусом 200
    res.status(200).json({ user });
  } catch (error) {
    next(error);
  }
};
// ===========================================================================================
