// ===========================================================================================
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
// import createHttpError from 'http-errors';

// Імпорт моделі користувача User
// import { User } from '../models/user.js';

// ===========================================================================================
// GET /users/me
// -------------------------------------------------------------------------------------------
export const getCurrentUser = async (req, res) => {
  const { _id, name, email } = req.user;

  res.status(200).json({
    status: 200,
    data: {
      _id,
      name,
      email,
    },
  });
};
// ===========================================================================================
