// Сервер

// Імпорт фреймворка для Node.js - Express - для створення веб-сервера.
// Він спрощує створення HTTP-серверів та REST API:
import express from 'express';
// Імпорт бібліотеки Helmet - для підвищення безпеки HTTP-заголовків
import helmet from 'helmet';
// Імпорт бібліотеки CORS - для дозволу запитів з інших джерел
import cors from 'cors';
// Імпорт бібліотеки для парсера кук
import cookieParser from 'cookie-parser';

//! ==================ІМПОРТИ ДЛЯ SWAGGER
import swaggerUi from 'swagger-ui-express';
import fs from 'fs';
import path from 'path';
//! =====================================

// Імпорт та налаштування пакету для читання змінних оточення з файлу .env
import 'dotenv/config';
// Імпорт функції для підключення до бази даних MongoDB
import { connectMongoDB } from './db/connectMongoDB.js';

// Імпорт middleware для логування HTTP-запитів
import { logger } from './middleware/logger.js';
// Імпорт middleware для обробки неіснуючих маршрутів
import { notFoundHandler } from './middleware/notFoundHandler.js';
// Імпорт middleware для обробки помилок
import { errorHandler } from './middleware/errorHandler.js';

// Імпорт middleware для обробки помилок валідації
import { errors } from 'celebrate';

// Імпорт роутерів з маршрутами
import authRoutes from './routes/authRoutes.js';

import usersRoutes from './routes/usersRoutes.js';
import categories from './routes/categoriesRoutes.js';
import ingredients from './routes/ingredientsRoutes.js';
import recipes from './routes/recipesRoutes.js';

// Створення екземпляру Express-додатку
const app = express();

// Використовуємо значення з .env (process.env.PORT) або дефолтний порт 3000
const PORT = process.env.PORT ?? 3000;

// =========================================================================
// Глобальні middleware - застосовуються до всіх маршрутів і запитів, які приходять на сервер
// =========================================================================
// Підключення та налаштування - Логування запитів - перший middleware
app.use(logger);

// Підключення та налаштування - Helmet - для підвищення безпеки HTTP-заголовків
app.use(helmet());

// express.json() - для парсингу JSON. Воно автоматично парсить (розпаковує) тіло HTTP-запиту,
// якщо воно надійшло у форматі JSON, і додає його у req.body.
app.use(
  express.json({
    type: ['application/json', 'application/vnd.api+json'], // Додаткові типи (за потреби)
    limit: '100kb', // Обмеження розмілу тіла - максимум 100 кілобайт (за потреби)
  }),
);

// Дозволяє запити з будь-яких джерел
app.use(
  cors({
    methods: ['GET', 'POST', 'PATCH', 'DELETE'], // дозволені HTTP-методи (за потреби)
    origin: '*', // дозволяє запити з будь-якого джерела (можна обмежити до конкретних доменів)
  }),
);

// Парсер кук (для можливості читати cookie)
app.use(cookieParser());
// ===========================================================================================

//! ============================== БЛОК ПІДКЛЮЧЕННЯ SWAGGER
// автогенерує swagger-autogen
const swaggerDocument = JSON.parse(
  fs.readFileSync(path.resolve('./src/swagger-output.json'), 'utf-8'),
);

// Залізобетонне налаштування хостів
if (process.env.NODE_ENV === 'production' || process.env.RENDER) {
  // Прямо прописуємо твій продакшн URL для Render
  swaggerDocument.host = 'tasteorama-backend-jumn.onrender.com';
  swaggerDocument.schemes = ['https']; // Використовуємо тільки безпечний HTTPS
  swaggerDocument.basePath = '/';
} else {
  // Для локального розробки залишаємо роботу з localhost
  swaggerDocument.host = `localhost:${PORT}`;
  swaggerDocument.schemes = ['http'];
  swaggerDocument.basePath = '/';
}

// маршрут документації
app.use('/api-docs', swaggerUi.serve, swaggerUi.setup(swaggerDocument));
//! ===================================================

// ===========================================================================================
// Маршрути - визначають, як сервер відповідає на різні HTTP-запити
// (GET, POST, PUT, DELETE) до певних URL-шляхів.
// ===========================================================================================

// Підключення роутера з маршрутами реєстрації та аутентифікації користувача
app.use(authRoutes);

// ===========================================================================================
// Підключення роутера з маршрутом отримання данних користувача
app.use(usersRoutes);

// ===========================================================================================
// Підключення роутера з маршрутом отримання списку категорій
app.use(categories);

// ===========================================================================================
// Підключення роутера з маршрутом отримання списку інгредієнтів
app.use(ingredients);

// ===========================================================================================
// Підключення роутера з маршрутами для роботи з рецептами
app.use(recipes);

// ===========================================================================================
// Middleware 404 - для неіснуючих маршрутів
// ===========================================================================================
// Підключається після всіх маршрутів, але перед middleware для обробки помилок.
// Якщо жоден із маршрутів не збігся, керування дійде сюди.
app.use(notFoundHandler);
// ===========================================================================================

// ===========================================================================================
// Middleware - обробка помилок від celebrate (валідація)
// ===========================================================================================
app.use(errors());
// ===========================================================================================

// ===========================================================================================
// Middleware для обробки помилок - має бути останнім після всіх маршрутів та інших middleware.
// ===========================================================================================
app.use(errorHandler);
// ===========================================================================================

// ===========================================================================================
// Викликаємо функцію для підключення до MongoDB перед запуском сервера
await connectMongoDB();
// ===========================================================================================

// ===========================================================================================
// Запуск сервера - прослуховування вказаного порту
app.listen(PORT, () => {
  console.log(`Server is running on port ${PORT}`);
});
// ===========================================================================================
